OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j99.h
#define _S40C3                  0x01
#define _S41C3                  0x02
#define _S42C3                  0x04
#define _S43C3                  0x08
#define _S44C3                  0x10
#define _S45C3                  0x20
#define _S46C3                  0x40
#define _S47C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA30 Bits

extern __at(0x0EAC) __sfr LCDDATA30;

typedef struct
  {
  unsigned S48C3                : 1;
  unsigned S49C3                : 1;
  unsigned S50C3                : 1;
  unsigned S51C3                : 1;
  unsigned S52C3                : 1;
  unsigned S53C3                : 1;
  unsigned S54C3                : 1;
  unsigned S55C3                : 1;
  } __LCDDATA30bits_t;

extern __at(0x0EAC) volatile __LCDDATA30bits_t LCDDATA30bits;

#define _S48C3                  0x01
#define _S49C3                  0x02
#define _S50C3                  0x04
#define _S51C3                  0x08
#define _S52C3                  0x10
#define _S53C3                  0x20
#define _S54C3                  0x40
#define _S55C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA31 Bits

extern __at(0x0EAD) __sfr LCDDATA31;

typedef struct
  {
  unsigned S56C3                : 1;
  unsigned S57C3                : 1;
  unsigned S58C3                : 1;
  unsigned S59C3                : 1;
  unsigned S60C3                : 1;
  unsigned S61C3                : 1;
  unsigned S62C3                : 1;
  unsigned S63C3                : 1;
  } __LCDDATA31bits_t;

extern __at(0x0EAD) volatile __LCDDATA31bits_t LCDDATA31bits;

#define _S56C3                  0x01
#define _S57C3                  0x02
#define _S58C3                  0x04
#define _S59C3                  0x08
#define _S60C3                  0x10
#define _S61C3                  0x20
#define _S62C3                  0x40
#define _S63C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA32 Bits

extern __at(0x0EAE) __sfr LCDDATA32;

typedef struct
  {
  unsigned S00C4                : 1;
  unsigned S01C4                : 1;
  unsigned S02C4                : 1;
  unsigned S03C4                : 1;
  unsigned S04C4                : 1;
  unsigned S05C4                : 1;
  unsigned S06C4                : 1;
  unsigned S07C4                : 1;
  } __LCDDATA32bits_t;

extern __at(0x0EAE) volatile __LCDDATA32bits_t LCDDATA32bits;

#define _S00C4                  0x01
#define _S01C4                  0x02
#define _S02C4                  0x04
#define _S03C4                  0x08
#define _S04C4                  0x10
#define _S05C4                  0x20
#define _S06C4                  0x40
#define _S07C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA33 Bits

extern __at(0x0EAF) __sfr LCDDATA33;

typedef struct
  {
  unsigned S08C4                : 1;
  unsigned S09C4                : 1;
  unsigned S10C4                : 1;
  unsigned S11C4                : 1;
  unsigned S12C4                : 1;
  unsigned S13C4                : 1;
  unsigned S14C4                : 1;
  unsigned S15C4                : 1;
  } __LCDDATA33bits_t;

extern __at(0x0EAF) volatile __LCDDATA33bits_t LCDDATA33bits;

#define _S08C4                  0x01
#define _S09C4                  0x02
#define _S10C4                  0x04
#define _S11C4                  0x08
#define _S12C4                  0x10
#define _S13C4                  0x20
#define _S14C4                  0x40
#define _S15C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA34 Bits

extern __at(0x0EB0) __sfr LCDDATA34;

typedef struct
  {
  unsigned S16C4                : 1;
  unsigned S17C4                : 1;
  unsigned S18C4                : 1;
  unsigned S19C4                : 1;
  unsigned S20C4                : 1;
  unsigned S21C4                : 1;
  unsigned S22C4                : 1;
  unsigned S23C4                : 1;
  } __LCDDATA34bits_t;

extern __at(0x0EB0) volatile __LCDDATA34bits_t LCDDATA34bits;

#define _S16C4                  0x01
#define _S17C4                  0x02
#define _S18C4                  0x04
#define _S19C4                  0x08
#define _S20C4                  0x10
#define _S21C4                  0x20
#define _S22C4                  0x40
#define _S23C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA35 Bits

extern __at(0x0EB1) __sfr LCDDATA35;

typedef struct
  {
  unsigned S24C4                : 1;
  unsigned S25C4                : 1;
  unsigned S26C4                : 1;
  unsigned S27C4                : 1;
  unsigned S28C4                : 1;
  unsigned S29C4                : 1;
  unsigned S30C4                : 1;
  unsigned S31C4                : 1;
  } __LCDDATA35bits_t;

extern __at(0x0EB1) volatile __LCDDATA35bits_t LCDDATA35bits;

#define _S24C4                  0x01
#define _S25C4                  0x02
#define _S26C4                  0x04
#define _S27C4                  0x08
#define _S28C4                  0x10
#define _S29C4                  0x20
#define _S30C4                  0x40
#define _S31C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA36 Bits

extern __at(0x0EB2) __sfr LCDDATA36;

typedef struct
  {
  unsigned S32C4                : 1;
  unsigned S33C4                : 1;
  unsigned S34C4                : 1;
  unsigned S35C4                : 1;
  unsigned S36C4                : 1;
  unsigned S37C4                : 1;
  unsigned S38C4                : 1;
  unsigned S39C4                : 1;
  } __LCDDATA36bits_t;

extern __at(0x0EB2) volatile __LCDDATA36bits_t LCDDATA36bits;

#define _S32C4                  0x01
#define _S33C4                  0x02
#define _S34C4                  0x04
#define _S35C4                  0x08
#define _S36C4                  0x10
#define _S37C4                  0x20
#define _S38C4                  0x40
#define _S39C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA37 Bits

extern __at(0x0EB3) __sfr LCDDATA37;

typedef struct
  {
  unsigned S40C4                : 1;
  unsigned S41C4                : 1;
  unsigned S42C4                : 1;
  unsigned S43C4                : 1;
  unsigned S44C4                : 1;
  unsigned S45C4                : 1;
  unsigned S46C4                : 1;
  unsigned S47C4                : 1;
  } __LCDDATA37bits_t;

extern __at(0x0EB3) volatile __LCDDATA37bits_t LCDDATA37bits;

#define _S40C4                  0x01
#define _S41C4                  0x02
#define _S42C4                  0x04
#define _S43C4                  0x08
#define _S44C4                  0x10
#define _S45C4                  0x20
#define _S46C4                  0x40
#define _S47C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA38 Bits

extern __at(0x0EB4) __sfr LCDDATA38;

typedef struct
  {
  unsigned S48C4                : 1;
  unsigned S49C4                : 1;
  unsigned S50C4                : 1;
  unsigned S51C4                : 1;
  unsigned S52C4                : 1;
  unsigned S53C4                : 1;
  unsigned S54C4                : 1;
  unsigned S55C4                : 1;
  } __LCDDATA38bits_t;

extern __at(0x0EB4) volatile __LCDDATA38bits_t LCDDATA38bits;

#define _S48C4                  0x01
#define _S49C4                  0x02
#define _S50C4                  0x04
#define _S51C4                  0x08
#define _S52C4                  0x10
#define _S53C4                  0x20
#define _S54C4                  0x40
#define _S55C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA39 Bits

extern __at(0x0EB5) __sfr LCDDATA39;

typedef struct
  {
  unsigned S56C4                : 1;
  unsigned S57C4                : 1;
  unsigned S58C4                : 1;
  unsigned S59C4                : 1;
  unsigned S60C4                : 1;
  unsigned S61C4                : 1;
  unsigned S62C4                : 1;
  unsigned S63C4                : 1;
  } __LCDDATA39bits_t;

extern __at(0x0EB5) volatile __LCDDATA39bits_t LCDDATA39bits;

#define _S56C4                  0x01
#define _S57C4                  0x02
#define _S58C4                  0x04
#define _S59C4                  0x08
#define _S60C4                  0x10
#define _S61C4                  0x20
#define _S62C4                  0x40
#define _S63C4                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA40 Bits

extern __at(0x0EB6) __sfr LCDDATA40;

typedef struct
  {
  unsigned S00C5                : 1;
  unsigned S01C5                : 1;
  unsigned S02C5                : 1;
  unsigned S03C5                : 1;
  unsigned S04C5                : 1;
  unsigned S05C5                : 1;
  unsigned S06C5                : 1;
  unsigned S07C5                : 1;
  } __LCDDATA40bits_t;

