OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j99.h
extern __at(0x0EBE) __sfr LCDDATA48;

typedef struct
  {
  unsigned S00C6                : 1;
  unsigned S01C6                : 1;
  unsigned S02C6                : 1;
  unsigned S03C6                : 1;
  unsigned S04C6                : 1;
  unsigned S05C6                : 1;
  unsigned S06C6                : 1;
  unsigned S07C6                : 1;
  } __LCDDATA48bits_t;

extern __at(0x0EBE) volatile __LCDDATA48bits_t LCDDATA48bits;

#define _S00C6                  0x01
#define _S01C6                  0x02
#define _S02C6                  0x04
#define _S03C6                  0x08
#define _S04C6                  0x10
#define _S05C6                  0x20
#define _S06C6                  0x40
#define _S07C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA49 Bits

extern __at(0x0EBF) __sfr LCDDATA49;

typedef struct
  {
  unsigned S08C6                : 1;
  unsigned S09C6                : 1;
  unsigned S10C6                : 1;
  unsigned S11C6                : 1;
  unsigned S12C6                : 1;
  unsigned S13C6                : 1;
  unsigned S14C6                : 1;
  unsigned S15C6                : 1;
  } __LCDDATA49bits_t;

extern __at(0x0EBF) volatile __LCDDATA49bits_t LCDDATA49bits;

#define _S08C6                  0x01
#define _S09C6                  0x02
#define _S10C6                  0x04
#define _S11C6                  0x08
#define _S12C6                  0x10
#define _S13C6                  0x20
#define _S14C6                  0x40
#define _S15C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA50 Bits

extern __at(0x0EC0) __sfr LCDDATA50;

typedef struct
  {
  unsigned S16C6                : 1;
  unsigned S17C6                : 1;
  unsigned S18C6                : 1;
  unsigned S19C6                : 1;
  unsigned S20C6                : 1;
  unsigned S21C6                : 1;
  unsigned S22C6                : 1;
  unsigned S23C6                : 1;
  } __LCDDATA50bits_t;

extern __at(0x0EC0) volatile __LCDDATA50bits_t LCDDATA50bits;

#define _S16C6                  0x01
#define _S17C6                  0x02
#define _S18C6                  0x04
#define _S19C6                  0x08
#define _S20C6                  0x10
#define _S21C6                  0x20
#define _S22C6                  0x40
#define _S23C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA51 Bits

extern __at(0x0EC1) __sfr LCDDATA51;

typedef struct
  {
  unsigned S24C6                : 1;
  unsigned S25C6                : 1;
  unsigned S26C6                : 1;
  unsigned S27C6                : 1;
  unsigned S28C6                : 1;
  unsigned S29C6                : 1;
  unsigned S30C6                : 1;
  unsigned S31C6                : 1;
  } __LCDDATA51bits_t;

extern __at(0x0EC1) volatile __LCDDATA51bits_t LCDDATA51bits;

#define _S24C6                  0x01
#define _S25C6                  0x02
#define _S26C6                  0x04
#define _S27C6                  0x08
#define _S28C6                  0x10
#define _S29C6                  0x20
#define _S30C6                  0x40
#define _S31C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA52 Bits

extern __at(0x0EC2) __sfr LCDDATA52;

typedef struct
  {
  unsigned S32C6                : 1;
  unsigned S33C6                : 1;
  unsigned S34C6                : 1;
  unsigned S35C6                : 1;
  unsigned S36C6                : 1;
  unsigned S37C6                : 1;
  unsigned S38C6                : 1;
  unsigned S39C6                : 1;
  } __LCDDATA52bits_t;

extern __at(0x0EC2) volatile __LCDDATA52bits_t LCDDATA52bits;

#define _S32C6                  0x01
#define _S33C6                  0x02
#define _S34C6                  0x04
#define _S35C6                  0x08
#define _S36C6                  0x10
#define _S37C6                  0x20
#define _S38C6                  0x40
#define _S39C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA53 Bits

extern __at(0x0EC3) __sfr LCDDATA53;

typedef struct
  {
  unsigned S40C6                : 1;
  unsigned S41C6                : 1;
  unsigned S42C6                : 1;
  unsigned S43C6                : 1;
  unsigned S44C6                : 1;
  unsigned S45C6                : 1;
  unsigned S46C6                : 1;
  unsigned S47C6                : 1;
  } __LCDDATA53bits_t;

extern __at(0x0EC3) volatile __LCDDATA53bits_t LCDDATA53bits;

#define _S40C6                  0x01
#define _S41C6                  0x02
#define _S42C6                  0x04
#define _S43C6                  0x08
#define _S44C6                  0x10
#define _S45C6                  0x20
#define _S46C6                  0x40
#define _S47C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA54 Bits

extern __at(0x0EC4) __sfr LCDDATA54;

typedef struct
  {
  unsigned S48C6                : 1;
  unsigned S49C6                : 1;
  unsigned S50C6                : 1;
  unsigned S51C6                : 1;
  unsigned S52C6                : 1;
  unsigned S53C6                : 1;
  unsigned S54C6                : 1;
  unsigned S55C6                : 1;
  } __LCDDATA54bits_t;

extern __at(0x0EC4) volatile __LCDDATA54bits_t LCDDATA54bits;

