OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j99.h
extern __at(0x0EE0) volatile __REFO1CON2bits_t REFO1CON2bits;

#define _RODIV0                 0x01
#define _RODIV1                 0x02
#define _RODIV2                 0x04
#define _RODIV3                 0x08
#define _RODIV4                 0x10
#define _RODIV5                 0x20
#define _RODIV6                 0x40
#define _RODIV7                 0x80

//==============================================================================


//==============================================================================
//        REFO1CON1 Bits

extern __at(0x0EE1) __sfr REFO1CON1;

typedef union
  {
  struct
    {
    unsigned ROSEL0             : 1;
    unsigned ROSEL1             : 1;
    unsigned ROSEL2             : 1;
    unsigned ROSEL3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ROSEL              : 4;
    unsigned                    : 4;
    };
  } __REFO1CON1bits_t;

extern __at(0x0EE1) volatile __REFO1CON1bits_t REFO1CON1bits;

#define _ROSEL0                 0x01
#define _ROSEL1                 0x02
#define _ROSEL2                 0x04
#define _ROSEL3                 0x08

//==============================================================================


//==============================================================================
//        REFO1CON Bits

extern __at(0x0EE2) __sfr REFO1CON;

typedef struct
  {
  unsigned ACTIVE               : 1;
  unsigned DIVSWEN              : 1;
  unsigned                      : 1;
  unsigned ROSSLP               : 1;
  unsigned ROOE                 : 1;
  unsigned ROSIDL               : 1;
  unsigned                      : 1;
  unsigned ROON                 : 1;
  } __REFO1CONbits_t;

extern __at(0x0EE2) volatile __REFO1CONbits_t REFO1CONbits;

#define _ACTIVE                 0x01
#define _DIVSWEN                0x02
#define _ROSSLP                 0x08
#define _ROOE                   0x10
#define _ROSIDL                 0x20
#define _ROON                   0x80

//==============================================================================


//==============================================================================
//        MEMCON Bits

extern __at(0x0EE3) __sfr MEMCON;

typedef union
  {
  struct
    {
    unsigned WM0                : 1;
    unsigned WM1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned WAIT0              : 1;
    unsigned WAIT1              : 1;
    unsigned                    : 1;
    unsigned EBDIS              : 1;
    };

  struct
    {
    unsigned WM                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned WAIT               : 2;
    unsigned                    : 2;
    };
  } __MEMCONbits_t;

extern __at(0x0EE3) volatile __MEMCONbits_t MEMCONbits;

#define _MEMCON_WM0             0x01
#define _MEMCON_WM1             0x02
#define _MEMCON_WAIT0           0x10
#define _MEMCON_WAIT1           0x20
#define _MEMCON_EBDIS           0x80

//==============================================================================


//==============================================================================
//        PORTL Bits

extern __at(0x0EE4) __sfr PORTL;

typedef struct
  {
  unsigned RL0                  : 1;
  unsigned RL1                  : 1;
  unsigned RL2                  : 1;
  unsigned RL3                  : 1;
  unsigned RL4                  : 1;
  unsigned RL5                  : 1;
  unsigned RL6                  : 1;
  unsigned RL7                  : 1;
  } __PORTLbits_t;

extern __at(0x0EE4) volatile __PORTLbits_t PORTLbits;

#define _RL0                    0x01
#define _RL1                    0x02
#define _RL2                    0x04
#define _RL3                    0x08
#define _RL4                    0x10
#define _RL5                    0x20
#define _RL6                    0x40
#define _RL7                    0x80

//==============================================================================


//==============================================================================
//        LATL Bits

extern __at(0x0EE5) __sfr LATL;

typedef struct
  {
  unsigned LATL0                : 1;
  unsigned LATL1                : 1;
  unsigned LATL2                : 1;
  unsigned LATL3                : 1;
  unsigned LATL4                : 1;
  unsigned LATL5                : 1;
  unsigned LATL6                : 1;
  unsigned LATL7                : 1;
  } __LATLbits_t;

extern __at(0x0EE5) volatile __LATLbits_t LATLbits;

#define _LATL0                  0x01
#define _LATL1                  0x02
#define _LATL2                  0x04
#define _LATL3                  0x08
#define _LATL4                  0x10
#define _LATL5                  0x20
#define _LATL6                  0x40
#define _LATL7                  0x80

//==============================================================================


//==============================================================================
//        TRISL Bits

extern __at(0x0EE6) __sfr TRISL;

typedef struct
  {
  unsigned TRISL0               : 1;
  unsigned TRISL1               : 1;
  unsigned TRISL2               : 1;
  unsigned TRISL3               : 1;
  unsigned TRISL4               : 1;
  unsigned TRISL5               : 1;
  unsigned TRISL6               : 1;
  unsigned TRISL7               : 1;
  } __TRISLbits_t;

extern __at(0x0EE6) volatile __TRISLbits_t TRISLbits;

#define _TRISL0                 0x01
#define _TRISL1                 0x02
#define _TRISL2                 0x04
#define _TRISL3                 0x08
#define _TRISL4                 0x10
#define _TRISL5                 0x20
#define _TRISL6                 0x40
#define _TRISL7                 0x80

//==============================================================================


//==============================================================================
//        PORTK Bits

extern __at(0x0EE7) __sfr PORTK;

typedef struct
  {
  unsigned RK0                  : 1;
  unsigned RK1                  : 1;
  unsigned RK2                  : 1;
  unsigned RK3                  : 1;
  unsigned RK4                  : 1;
  unsigned RK5                  : 1;
  unsigned RK6                  : 1;
  unsigned RK7                  : 1;
  } __PORTKbits_t;

